dic = {
    '宜宾市国资经营公司原董事长张辉被开除党籍和公职': ['要闻', '四川省纪委监委官网 ', '13607  阅读 ', [
        '据四川省纪委监委官网今日（1月11日）16时35分发布的消息称：日前，经宜宾市委批准，市纪委监委对市国有资产经营有限公司原董事长张辉严重违纪违法问题进行了立案审查调查。']],
    '雷军小米年会称：2019年“All in IoT”': ['要闻', '每日经济新闻 ', '12660  阅读 ', ['每经记者 刘春山', '每经编辑 宋思艰']],
    '长三角上市公司占深市总数的28%': ['推荐', '每日经济新闻 ', '15570  阅读 ', ['每经记者 吴凡', '每经编辑 胥帅']],
    '京东、苏宁两大电商平台下调部分iPhone产品价格': ['要闻', '每日经济新闻 ', '16034  阅读 ', ['每经记者 王晶', '每经编辑 胥帅']],
    ' 雷军“护犊子”喊话友商“不服就干”': ['要闻', '每日经济新闻 ', '15577  阅读 ', ['每经记者 李少婷', '每经编辑 胥帅']],
    '上交所副总经理刘绍统：最近10年市值增长近三倍': ['要闻', '每日经济新闻 ', '15026  阅读 ', ['每经记者 吴凡', '每经编辑 胥帅']],
    '共享打印能否成为共享经济的下一个“风口”？': ['产业趋势', '每日经济新闻 ', '13340  阅读 ', ['每经记者 曾剑', '每经编辑 徐斐']],
    '兰州民百控股股东欲提前解除不质押承诺以赎回债券': ['要闻', '每日经济新闻 ', '12171  阅读 ', ['每经记者 胥帅', '每经编辑 张海妮']],
    '上海交大安泰经管学院杨颉：打通政产学研资用创新通道': ['商业人物', '每日经济新闻 ', '16426  阅读 ', ['每经记者 张韵', '每经编辑 宋思艰']],
    '借款影响子公司经营  联建光电降低对其业绩承诺要求 ': ['热点公司', '每日经济新闻 ', '6894  阅读 ', ['每经记者 莫淑婷', '每经编辑 张海妮']],
    '10亿元买两架飞机 海特高新董事长如此回应': ['要闻', '每日经济新闻 ', '5464  阅读 ', ['每经记者 靳水平', '每经编辑 魏官红']],
    '华强北iPhone批发商：拿货价确实降了': ['要闻', '每日经济新闻 ', '5691  阅读 ', ['每经记者 王晶', '每经编辑 文多']],
    '厦航董事长车尚轮届满退休 继任者暂未确定': ['要闻', '每日经济新闻 ', '9517  阅读 ', ['每经记者 张晓庆', '每经编辑 文多']],
    '居然之家放弃IPO拟借道武汉中商登A股    ': ['热点公司', '每日经济新闻 ', '6801  阅读 ', ['每经记者 陈晴', '每经编辑 张海妮']],
    '空客2018年共交付800架民用飞机  ': ['要闻', '每日经济新闻 ', '13130  阅读 ', ['实习记者 王帆 每经记者 陈鹏丽', '每经编辑 徐斐']],
    '2019年CES手机企业多缺席 电商平台参展秀肌肉': ['要闻', '每日经济新闻 ', '14554  阅读 ', ['每经记者 刘春山', '每经编辑 陈俊杰']],
    '拖堂150分钟 张小龙阐释微信7.0小程序和小游戏': ['推荐', '每日经济新闻 ', '15095  阅读 ', ['每经记者 宗旭', '每经编辑 陈俊杰']],
    '宝塔实业子公司股权冻结情况及股价涨停均被问询': ['推荐', '每日经济新闻 ', '12912  阅读 ', ['每经记者 谢宏辰', '每经编辑 陈俊杰']],
    '上海凤凰子公司与ofo达成和解 剩余货款同意分期': ['要闻', '每日经济新闻 ', '8220  阅读 ', ['每经记者 李少婷', '每经编辑 陈俊杰']],
    'iPhone新一轮降价表来了！最高降450元': ['热点公司', '每日经济新闻 ', '12210  阅读 ', ['每经记者 王晶', '每经编辑 文多']],
    '开始降价！苹果产品在华渠道价最高直降450元': ['要闻', '每日经济新闻 ', '17073  阅读 ', ['每经记者 王晶', '每经编辑 文多']],
    '广电牵手中信集团 探索广电5G网络顶层设计': ['热点公司', '每日经济新闻 ', '12339  阅读 ', ['每经记者 刘春山', '每经编辑 文多']],
    '领益智造部分股票遭冻结 三名原副董事长陷借贷纠纷': ['热点公司', '每日经济新闻 ', '5557  阅读 ', ['每经记者 邱德坤', '每经编辑 徐斐']],
    '银隆新能源公布魏银仓等涉嫌侵占财产案细节 ': ['热点公司', '每日经济新闻 ', '10452  阅读 ', ['每经记者 陈鹏丽', '每经编辑 张海妮']],
    '数月内第三次！长航凤凰子公司再现批量辞职': ['要闻', '每日经济新闻 ', '10294  阅读 ', ['每经记者 陈晴', '每经编辑 文多']],
    '权健集团实控人束昱辉之子旗下海鸟城已停止加盟': ['要闻', '每日经济新闻 ', '3400  阅读 ', ['每经记者 张虹蕾 实习生 涂悦清', '实习编辑 梁枭']],
    '九连板！ 是谁在追涨风范股份？': ['要闻', '每日经济新闻 ', '8534  阅读 ', ['每经记者 胥帅', '每经编辑 魏官红']],
    '挥别“黄金时代”！珠宝行业如何面对被动消费升级？': ['推荐', '每日经济新闻 ', '14253  阅读 ', ['每经记者 李诗琪', '每经编辑 徐斐']],
    '香飘飘供货商熊猫乳品终止A股IPO申请': ['推荐', '每日经济新闻 ', '8771  阅读 ', ['每经记者 陈祺欣', '每经编辑 胥帅']],
    '雅芳小姐美人迟暮？ 4400万美元卖工厂力挽芳华': ['热点公司', '每日经济新闻 ', '10115  阅读 ', ['实习记者 王帆  每经记者 陈鹏丽', '每经编辑 宋思艰']],
    '理工环科大股东“借马甲”炒股  不仅被罚还炒亏了': ['热点公司', '每日经济新闻 ', '6541  阅读 ', ['每经记者 曾剑', '每经编辑 文多']],
    '谁来拯救这支创足坛连胜记录的川足冠军队？': ['推荐', '每日经济新闻 ', '17438  阅读 ', ['每经记者 朱万平', '每经编辑 胥帅']],
    '金龙机电控制权成谜  ': ['热点公司', '每日经济新闻 ', '7540  阅读 ', ['每经记者 吴治邦  ', '每经编辑 张海妮']],
    '光伏行业协会秘书长：去年新增装机容量预计达40GW': ['产业趋势', '每日经济新闻 ', '13266  阅读 ', ['每经记者 查道坤', '实习编辑 梁枭']],
    '组织架构调整100天后 腾讯技术委员会终于成立': ['热点公司', '每日经济新闻 ', '6622  阅读 ', ['每经记者 宗旭', '每经编辑 魏官红']],
    '协鑫集团董事长朱共山：今年光伏将进入非补贴元年': ['产业趋势', '每日经济新闻 ', '3692  阅读 ', ['每经记者 查道坤', '每经编辑 徐斐']],
    '四川2018年工业运行“好于预期，高于全国”': ['区域经济', '每日经济新闻 ', '6432  阅读 ', ['每经记者 靳水平', '每经编辑 文多']]
}

for k, v in dic.items():
    title = k
    abstrct, source, browser = ["".join(i) for i in v if isinstance(i, str)]
    author = ",".join(v[-1])

    print(title, abstrct, source, browser, author)
